const landingPageComponents = {
  feature: [
    {
      heading: "廣獲採用",
      desc: " OSM 圖資廣獲包括 Amazon、Apple、BBC、facebook、Garmin、Uber、精靈寶可夢GO、中華郵政、法國航空、劍橋大學、維基百科等具領導地位的組織採用，在不同領域當中都深受歡迎。",
      SVGpath:
        "M4.318 6.318a4.5 4.5 0 000 6.364L12 20.364l7.682-7.682a4.5 4.5 0 00-6.364-6.364L12 7.636l-1.318-1.318a4.5 4.5 0 00-6.364 0z",
    },
    {
      heading: "開放開源",
      desc: "OSM 是一個「屬於大家的地圖」，任何人都可以參與製圖，且自由與免費地使用地圖，開放的授權與格式更可以讓使用者自由地去延伸、應用 OSM 圖資。",
      SVGpath:
        "M4 7v10c0 2.21 3.582 4 8 4s8-1.79 8-4V7M4 7c0 2.21 3.582 4 8 4s8-1.79 8-4M4 7c0-2.21 3.582-4 8-4s8 1.79 8 4m0 5c0 2.21-3.582 4-8 4s-8-1.79-8-4",
    },
    {
      heading: "在地智識",
      desc: "全球每日有超過100萬名的圖客對 OSM 地理圖資作出編輯貢獻，並貢獻超過40億的資料點 (node)，OSM 儼然成為大家生活中不可或缺的一環。",
      SVGpath: "M13 10V3L4 14h7v7l9-11h-7z",
    },
    {
      heading: "社群導向",
      desc: "正如同維基百科保有每次編輯的記錄備査，OSM 也有複査機制供貢獻者巡査編輯記錄，確保圖資能夠正確繪製，讓地圖使用者能獲得並使用詳實的地圖。",
      SVGpath:
        "M17 20h5v-2a3 3 0 00-5.356-1.857M17 20H7m10 0v-2c0-.656-.126-1.283-.356-1.857M7 20H2v-2a3 3 0 015.356-1.857M7 20v-2c0-.656.126-1.283.356-1.857m0 0a5.002 5.002 0 019.288 0M15 7a3 3 0 11-6 0 3 3 0 016 0zm6 3a2 2 0 11-4 0 2 2 0 014 0zM7 10a2 2 0 11-4 0 2 2 0 014 0z",
    },
  ],
  hashtag: ["FLOSS", "開放格式", "開放式參與", "在地的故事", "在地的地圖"],
  quickStartGuide: [
    {
      role: "一般使用者",
      desc: "了解在日常生活中可見的 OSM 圖資及使用方式，包括實體文件、應用程式。",
      route: "/qsg/general/",
      SVGpath:
        "M15 15l-2 5L9 9l11 4-5 2zm0 0l5 5M7.188 2.239l.777 2.897M5.136 7.965l-2.898-.777M13.95 4.05l-2.122 2.122m-5.657 5.656l-2.12 2.122",
    },
    {
      role: "新手圖客",
      desc: "了解構成 OSM 的幾何資料模型，以及如何編輯地圖及建構關聯。",
      route: "/qsg/mapper/",
      SVGpath:
        "M9 20l-5.447-2.724A1 1 0 013 16.382V5.618a1 1 0 011.447-.894L9 7m0 13l6-3m-6 3V7m6 10l4.553 2.276A1 1 0 0021 18.382V7.618a1 1 0 00-.553-.894L15 4m0 13V4m0 0L9 7",
    },
    {
      role: "開發者",
      desc: "了解如何透過 OSM 及其他相關工具為你的專案帶來更大效益。",
      route: "/qsg/developer/",
      SVGpath:
        "M8 9l3 3-3 3m5 0h3M5 20h14a2 2 0 002-2V6a2 2 0 00-2-2H5a2 2 0 00-2 2v12a2 2 0 002 2z",
    },
  ],
};

export { landingPageComponents };
